print('Задача 5. Вася хочет выигрывать')

# data_num1, data_num2, data_num3 = map(int, input().split())
# data_num1, data_num2, data_num3 = (int(i) for i in input().split())
data_num1 = int(input())
data_num2 = int(input())
data_num3 = int(input())

if data_num1 == data_num2 == data_num3:
    print(3)
elif (data_num1 == data_num2) or (data_num3 == data_num2) or (data_num3 == data_num1):
    print(2)
else:
    print(0)

# Вася вдохновился фильмом «Двадцать одно» и решил изучить математику игровых автоматов. Для анализа данных ему нужна информация о том, как часто в автомате выпадает три или две одинаковых картинки. Для сбора данных нужна программа, проверяющая это равенство.

# Даны три целых числа. Определите, сколько среди них совпадающих.
# Программа должна вывести один из вариантов:
# 1) 3 (если все совпадают)
# 2) 2 (если два совпадают)
# 3) 0 (если все числа разные)
