print('Задача 6. Новоселье')

square = int(input("Введите площадь квартиры: "))
price = int(input("Введите стоимость квартиры: "))

# Семья из трёх человек устала тесниться в однушке и наконец решила переехать.
# При обсуждении,
# какую же всё-таки купить квартиру исходя из своих предпочтений и семейного бюджета,
# они остановились на нескольких вариантах:

# Первый вариант
# они готовы взять квартиру попросторнее (не менее 100 квадратных метров),
# но стоимостью не более 10 млн.
if square > 99 and price < 10_000_001:
    print("Подходит по первому варианту!")

# Второй вариант — немного расширить круг поиска,
# то есть взять квартиру поменьше (от 80 квадратный метров),
# но и стоимостью не более 7 млн.
elif square > 80 and price < 7_000_001:
    print("Подходит по второму варианту!")

# Напишите программу,
# которая получает на вход стоимость квартиры и её площадь
# и выводит сообщение о том, подходит она или нет
else:
    print("Не подходит!")
