print('Задача 7. Почта')

receiving_time = int(input("Введите время получения от 0 до 23: "))

if (10 <= receiving_time < 12) or (18 <= receiving_time < 20) or (14 <= receiving_time < 15) or (
        0 < receiving_time < 8) or (receiving_time > 23):
    print("Посылку получить нельзя")
else:
    print("Можно получить посылку")

# Почтовое отделение открывается в 08:00 и закрывается в 22:00.
# С 14:00 до 15:00 все сотрудники уходят на обед,
# а в 10:00 и 18:00 приезжают машины с посылками,
# и тогда все сотрудники на два часа заняты их разгрузкой.
# Во время обеда, разумеется, посылки никто не выдаёт,
# как и в моменты, когда разгружаются машины.

# Напишите программу,
# которая получает на вход время в часах — число от 0 до 23 — и пишет,
# можно ли в этот час получить посылку.
# Используйте только один условный оператор if-else, без elif и прочего.

# Решите задание двумя способами:

# первый — при выполнении условия выводится сообщение:
# «Можно получить посылку»,

# второй —  при выполнении условия выводится сообщение:
# «Посылку получить нельзя».
