print('Задача 3. Поступление')

student_place = int(input("Введите место в списке поступающих: "))
student_score = int(input("Введите количество баллов за экзамены: "))
a = "Поздравляем, вы поступили!"

if student_place > 10:
    print("К сожалению, вы не поступили.")
elif (student_place < 11) and (student_score > 289):
    print(a, "\nБонусом Вам будет начисляться стипендия")
else:
    print(a, "\nНо Вам не хватило баллов для стипендии")

# В университете на особый факультет на направление кибернетики
# очень серьёзный конкурс — поступают только сильнейшие,
# первые десять человек из списка.
# Потом среди поступивших определяется, кто будет на стипендии.
# Для стипендии общий балл при поступлении должен составлять не менее 290.

# Напишите программу,
# которая получает на вход место студента в списке и его балл,
# а затем выводит соответствующие сообщения о поступлении и получении стипендии.

# Пример 1:
# Введите место в списке поступающих: 3
# Введите количество баллов за экзамены: 295
# Поздравляем, Вы поступили!
# Бонусом Вам будет начисляться стипендия

# Пример 2:
# Введите место в списке поступающих: 3
# Введите количество баллов за экзамены: 270
# Поздравляем, Вы поступили!
# Но Вам не хватило баллов для стипендии

# Пример 3:
# Введите место в списке поступающих: 11
# К сожалению, вы не поступили.
