print('Задача 4. Отрезок')

num_a, num_b, num_c = int(input("Начало отрезка: ")), int(input("Конец отрезка: ")), int(input("Кратность "))

for point in range(num_a, num_b):
    if point % num_c == 0:
        print(point)

# Напишите программу, которая считывает с клавиатуры три числа a, b и c, считает и выводит на консоль среднее арифметическое всех чисел из отрезка [a; b], кратных числу c.
