def cube_root(digit):
    return digit ** (1 / 3)  # результат можно вернуть не присваивая к переменной


num = int(input("Введите положительное целое число: "))
print(f'{cube_root(num):.1f}') if num > 0 else print("Число должно быть положительным")

# Я согласен с твоим решением, но функция не округляет результат, ты применяешь форматирование при выводе данных
# Нужно использовать встроенную функцию Python для округления результата вычислений в cube_root()
# Именно функция cube_root() должна возвращать округленное число.

# Кстати в этой задачи всё было правильно, для 218 результат будет, так как  218 ** (1/3) = 6.018461654806452 ~ 6.0

"""
Условие задачи:

Напишите функцию, которая находит кубический корень числа и возвращает его.

Примечание: Вещественные числа поддерживают те же операции, что и целые.
Однако (из-за представления чисел в компьютере) вещественные числа неточны, и это может привести к ошибкам.
Поэтому попробуйте округлить результат.
"""
