def several_arguments(*args):
    """
    Функция разбивает текст по пробелам и выводит каждый элемент на новой строке

    :param args: переменное количество аргументов
    :return: None
    """
    # из-за того, что в функцию передаешь один аргумент (список) тебе пришлось написать args[0] и итерировать
    # этот args[0] (список), на самом деле тебе нужно перебирать args

    # for item in args:
    for item in args[0]:
        print(item)


if s := input("Введите аргументы через пробел: ").strip().split():
    several_arguments(s)  # здесь ты передаешь функции не переменное количество аргументов, а список. Верно?
    # по условию задачи, тебе нужно передать несколько аргументов (не список аргументов)
else:
    print("Ошибка: Введите что нибудь...")

# Я бы написал условную конструкцию по-другому
if not (line := input('Введите аргументы через пробел: ').strip().split()):
    print('Ошибка: Введите что-нибудь...')
else:
    ...
    # several_arguments()  # здесь я бы вызвал функцию с переменным количеством аргументов
