def number_of_signs(sentence: str) -> int:
    """
    Функция считает количество символов во входящей строке без учета пробелов

    :param sentence: исходный текст (предложение)
    :return: возращает количество символов без учета пробелов
    """

    # зачем результат функции len() преобразуешь в int (если она и так воозвращает целое число)
    # функция должна была посчитать количество символов (каким-то образом убирая символы пробелов)
    # а ты уже выполнил это действие вне функции, а функция number_of_signs() просто копирует len()
    return len(sentence.replace(" ", ""))


# здесь метод strip() не нужен, и так функция убирает лишних пробелов, и посчитает кол-во символов :)
print(f'Количество символов в предложении: {number_of_signs(input("Введите предложение: "))}\n',
      number_of_signs.__doc__)
