def welcome(name):
    return name.title()  # На случай ввода имени и фамилии


print(welcome(input("Введите ваше имя: ")))

# Задача решена неправильно
# Ничего возвращать не нужно, просто нужно вывести Привет, name!
# Вместо title() лучше использовать другой аналогичный строковый метод
