def cube_root(digit: int) -> float:
    """
    Функция находит кубический корень числа

    :param digit: Целое положительное число из которого нужно получить кубический корень
    :return: Возвращает кубический корень числа
    """
    return round(digit ** (1 / 3), 1)  # Молодец!

    # Да, действительно для округления используется встроенная функция round()
    # вторым аргументом передается число, которое указывает количество знаков после запятой


print(f'{cube_root(num)}') if (num := int(input("Введите положительное целое число: "))) > 0 \
    else print("Число должно быть положительным")
