print('Задача 5. Отрезок')

a, b = int(input("Первая точка отрезка: ")), int(input("Вторая точка отрезка: "))
count = 0
for num in range(a, b + 1):
    if num % 3 == 0:
        count += num
print(f"среднее арифметическое всех чисел из отрезка [a; b], кратные 3 равно - {count}")

# Напишите программу,
# которая считывает с клавиатуры два числа a и b,
# считает и выводит на консоль
# среднее арифметическое всех чисел из отрезка [a; b], которые кратны числу 3.

# (среднее арифметическое можно посчитать поделив сумму подходящих чисел на их количество)
