print('Задача 2. Посчитай чужую зарплату...')

average_wage = 0
for month in range(12):
    wage = int(input(f"Введите зарплату за {month + 1}-й месяц: "))
    average_wage += wage
print(f"Средняя зарплата за год составила: {int(average_wage/12)}")
# Бухгалтер устала постоянно считать вручную среднегодовую зарплату сотрудников компании
# и, чтобы облегчить себе жизнь, обратилась к программисту.

# Напишите программу,
# которая принимает от пользователя зарплату сотрудника за каждый из 12 месяцев
# и выводит на экран среднюю зарплату за год.
