print('Задача 7. Пропавшая карточка')

cards = tuple(range(1, N := int(input("Введите количество карточек: ")) + 1))
summ = 0
for card in cards:
    summ += card

for _ in range(N - 2):
    summ -= (data := int(input("Введите номер оставшейся карточки: ")))

print(f"Номер пропавшей карточки: {summ}")
# Для настольной игры используются карточки с номерами от 1 до N.
# Одна карточка потерялась.
# Найдите ее, зная номера оставшихся карточек.
#
# Вводится число N,
# далее еще N − 1 чисел:
# номера оставшихся карточек (различные числа от 1 до N).
# Программа должна вывести номер потерянной карточки.

# Пример:
# Введите количество карточек: 5
# Введите номер оставшейся карточки: 1
# Введите номер оставшейся карточки: 4
# Введите номер оставшейся карточки: 5
# Введите номер оставшейся карточки: 3

# Номер пропавшей карточки: 2
