print('Задача 4. Успеваемость в классе')

students = int(input('Введите число учеников: '))
five = 0
four = 0
three = 0
for _ in range(1, students + 1):
    n = int(input('Введите оценку ученика: '))
    if n == 5:
        five += 1
    elif n == 4:
        four += 1
    elif n == 3:
        three += 1

if five > four and five > three:
    print('Отличников сегодня больше')
elif four > five and three:
    print('Хорошистов сегодня больше')
elif three > five and three > four:
    print('Троечников сегодня больше')

# В классе N человек.
# Каждый из них получил за урок по информатике оценку: 3, 4 или 5, двоек сегодня не было.
#
# Напишите программу,
# которая получает список оценок - N чисел - и выводит на экран сообщение о том,
# кого сегодня больше: отличников, хорошистов или троечников.

# Замечание: можно предположить, что количество отличников, хорошистов, троечников различно.
