print('Задача 1. Я стал новым пиратом!')
count = 0
for _ in range(10):
    if "Карамба" == (word := input("Введите слово: ").title()):
        count += 1
print(f'Слова "Карамба" совпадает {count} раз с введеными')

# Старому капитану нужно пополнить команду, но на корабль попадут только достойные! Он отобрал десять человек. Те, кто крикнет слово «Карамба», попадут на борт.

# Что нужно сделать

# Пользователь вводит десять слов. Напишите программу, которая определяет, сколько из них совпадают со словом «Карамба».
