print('Задача 5. Великий и могучий')

res = ""
count = 0
# data = input("Введите текст: ").split()
# for i in data:
#     if len(i) > count:
#         count = len(i)

data = input("Введите текст: ")
for char in data:
    if char != " ":
        res += char
    else:
        if count < len(res):
            count = len(res)
        res = ""
    if count < len(res):
        count = len(res)

print(f"Самое длинное слово {count}, букв")

# Паоло изучает русский язык: занимается по учебникам, читает книги, слушает музыку. Ему особенно понравилась книга «Преступление и наказание». Паоло решил найти самое длинное слово в этой книге, чтобы сравнить его с аналогом на своём языке.

# Что нужно сделать

# Напишите программу, которая получает на вход текст и находит длину самого длинного слова в нём. Слова в тексте разделяются одним пробелом.

# Пример:

# Введите текст: Меня зовут Пётр.
# Самое длинное слово, букв: 5.

# Введите текст: Меня зовут Василий
# Самое длинное слово, 7 букв
