print('Задача 8. Игра «Компьютер угадывает число»')

data = int(input("Введи число от 1 до 100 (включительно): "))
count = 0
start = 1
finish = 101

while count < 7:
    N = (start + finish) // 2
    print(f"Твоё число равно, меньше или больше, чем число {N}?")
    num = int(input("1 — равно, 2 — больше, 3 — меньше: "))
    if num == 1:
        print(f"Компьютер угадал число {data}")
        break
    elif num == 2:
        start = N
    elif num == 3:
        finish = N
    count += 1

# Поменяйте мальчика и компьютер из прошлой задачи местами.
# Теперь мальчик загадывает число между 1 и 100 (включительно).
# Компьютер может спросить у мальчика:
# «Твое число равно, меньше или больше, чем число N?»,
# где N — число, которое хочет проверить компьютер.
# Мальчик отвечает одним из трёх чисел:
# 1 — равно,
# 2 — больше,
# 3 — меньше.

# Напишите программу,
# которая с помощью цепочки таких вопросов и ответов мальчика угадывает число.

# Дополнительно: сделайте так, чтобы можно было гарантированно угадать число за семь попыток.

# Подсказка: используйте бинарный поиск, а не конкатенацию.
