print('Задача 4. Поставьте оценку!')

recall = int(input("Введите число: "))
negative_nums = 0
nums = 0

while (-101 < recall < 101) and recall != 0:
    if recall < 0:
        negative_nums += 1
    else:
        nums += 1
    recall = int(input("Введите число: "))

print(f"Кол-во положительных чисел: {nums}\nКол-во отрицательных чисел: {negative_nums}")

# Вася выложил своё новое приложение на платформу для начинающих разработчиков,
# на ней пользователи могут ставить оценку приложению от −100 до 100.
# Ему захотелось сравнить количество положительных и отрицательных отзывов,
# для этого он заранее отфильтровал все отзывы так,
# чтобы в конце были те, которые равны нулю.

# Напишите программу,
# которая находит количество положительных
# и количество отрицательных чисел в последовательности.
# Последовательность заканчивается на числе 0.

# Пример:
# Введите число: −4
# Введите число: −90
# Введите число: 6
# Введите число: 0
# Кол-во положительных чисел: 1
# Кол-во отрицательных чисел: 2
