print('Задача 1. Кубы чисел')

num = int(input("Введите число до которого необходимо возвести в степень: "))
count = 0

while count != num:
    count += 1
    print(count ** 3)

# В один из вечеров к Васе домой пришёл племянник и пожаловался на сложности с уроками математики: у него никак не получалось разобраться со степенями чисел. Вася решил помочь племяннику и написать программу, которая позволит наглядно увидеть возведение чисел в третью степень.

# Напишите программу, которая возводит в третью степень каждое число от 1 до N и выводит результат на экран.
