print('Задача 6. Вклады')

X = int(input("Введите сумму вклада: "))
P = int(input("Введите ежегодный %: "))
Y = int(input("Желаемая сумма вклада: "))
deposit = int(X + ((X * P) / 100))
count_year = 1

while deposit < Y:
    deposit = int(deposit + ((deposit * P) / 100))
    count_year += 1
print(f"Пройдет лет {count_year}")

# Вклад в банке составляет X рублей.
# Ежегодно он увеличивается на P процентов,
# после чего дробная часть копеек отбрасывается.

# Определите, через сколько лет вклад составит не менее Y рублей.

# Напишите программу,
# которая по данным числам X, Y, P определяет,
# сколько лет пройдёт, прежде чем сумма достигнет значения Y.
