num_1, num_2, num_3 = float(input()), float(input()), float(input())

# print(max(num_1, num_2, num_3))

if num_2 < num_1 > num_3:
    print(num_1)
elif num_1 < num_2 > num_3:
    print(num_2)
else:
    print(num_3)

"""
Задача 8. Максимальное число (по желанию)
Что нужно сделать

Пользователь вводит три числа.

Напишите программу, которая выводит на экран максимальное из этих трёх чисел (все числа разные). Используйте дополнительные переменные, если нужно.

"""
